# Задание 1
# int(673.3123) #уберется остаточная часть
# float(512) #целочисленные 512 из integer превратятся в float
# int(float(str(192))) #выведется целочислынные 192 integer
# float(173) + 5 #получаем ответ 178.0
# str(193.000000000001) #выведется строка 193.000000000001

# Задание 2
# Конкатенация - это метод, позволяет объединить несколько строк в одну. Для объединения строк используется знак +
# 'Calling ' + str(911) #выведется строкa Calling 911
# 'abc' + 'xyz' #выведется строкa abcxyz

# Задание 3
# a = 589
# b = 932.901
# c = 'Hello world'
# d = '892.01' #Ответ a + b = 589 + 932.901 = 1521.9009999999998
#                     c + d = 'Hello world' + '892.01' = Hello world892.01

# Дополнительное задание
# print("Hello world" + '589' + ' 892.01' + ' 932.901' + '589' + ' 892.01')